r = int(input("输入日子："))

print('-------------205-700-------------')
for i in range((r-1)*288+26, (r-1)*288+85+1):
    print("=J%d" % (i))

input('按任意键继续')
print("\n"*100)

for i in range((r-1)*288+26, (r-1)*288+85+1):
    print("=K%d" % (i))



# # 3月份调整夏令时：
# r = int(input("输入日子："))
#
# print('-------------205-700-------------')
# for i in range((r-1)*288+26-12, (r-1)*288+85+1-12):
#     print("=J%d" % (i))
#
# input('按任意键继续')
# print("\n"*100)
#
# for i in range((r-1)*288+26-12, (r-1)*288+85+1-12):
#     print("=K%d" % (i))